### Pruebas con ficheros

In [1]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

In [2]:
df = pd.read_csv("../ficheros_curso/merge/Pedidos.txt", sep=";")
df.head()

   idpedido cliente  idempleado  idempresa  importe       pais
0     10248   WILMK           5          3    32.38  Finlandia
1     10249   TOMSP           6          1    11.61   Alemania
2     10250   HANAR           4          2    65.83     Brasil
3     10251   VICTE           3          1    41.34    Francia
4     10252   SUPRD           4          2    51.30    Belgica

In [3]:
df.tail()

     idpedido cliente  idempleado  idempresa  importe            pais
825     11073   PERIC           2          2    24.95          Mexico
826     11074   SIMOB           7          2    18.44       Dinamarca
827     11075   RICSU           8          2     6.19           Suiza
828     11076   BONAP           4          2    38.28         Francia
829     11077   RATTC           1          2     8.53  Estados Unidos

In [4]:
df.shape

(830, 6)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 830 entries, 0 to 829
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   idpedido    830 non-null    int64
 1   cliente     830 non-null    object
 2   idempleado  830 non-null    int64
 3   idempresa   830 non-null    int64
 4   importe     830 non-null    float64
 5   pais        830 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 39.0+ KB

In [6]:
df.describe()

           idpedido  idempleado   idempresa      importe
count    830.000000  830.000000  830.000000   830.000000
mean   10662.500000    4.403614    2.008434    78.244205
std      239.744656    2.499648    0.778899   116.779294
min    10248.000000    1.000000    1.000000     0.020000
25%    10455.250000    2.000000    1.000000    13.380000
50%    10662.500000    4.000000    2.000000    41.360000
75%    10869.750000    7.000000    3.000000    91.430000
max    11077.000000    9.000000    3.000000  1007.640000

In [7]:
df.columns

Index(['idpedido', 'cliente', 'idempleado', 'idempresa', 'importe', 'pais'], dtype='object')

In [9]:
df.pais.value_counts()

pais
Estados Unidos    123
Alemania          122
Brasil             83
Francia            76
Reino Unido        55
Venezuela          46
Austria            40
Suecia             38
Canada             30
Mexico             28
Italia             28
Espanya            23
Finlandia          23
Irlanda            19
Belgica            19
Suiza              18
Dinamarca          18
Argentina          16
Portugal           13
Polonia             6
Noruega             6
Name: count, dtype: int64

In [11]:
paises = sorted(df.pais.unique())
paises

['Alemania',
 'Argentina',
 'Austria',
 'Belgica',
 'Brasil',
 'Canada',
 'Dinamarca',
 'Espanya',
 'Estados Unidos',
 'Finlandia',
 'Francia',
 'Irlanda',
 'Italia',
 'Mexico',
 'Noruega',
 'Polonia',
 'Portugal',
 'Reino Unido',
 'Suecia',
 'Suiza',
 'Venezuela']

In [12]:
df[df.pais == 'Alemania']

     idpedido cliente  idempleado  idempresa  importe      pais
1       10249   TOMSP           6          1    11.61  Alemania
12      10260   OTTIK           4          1    55.09  Alemania
19      10267   FRANK           4          1   208.58  Alemania
25      10273   QUICK           3          3    76.07  Alemania
29      10277   MORGK           2          3   125.77  Alemania
..        ...     ...         ...        ...      ...       ...
788     11036   DRACD           8          3   149.47  Alemania
798     11046   WANDK           8          2    71.64  Alemania
810     11058   BLAUS           9          3    31.14  Alemania
819     11067   DRACD           1          2     7.98  Alemania
822     11070   LEHMS           2          1   136.00  Alemania

[122 rows x 6 columns]

In [15]:
dfAle = df[(df.pais == 'Alemania') & (df.importe > 200)]
dfAle

     idpedido cliente  idempleado  idempresa  importe      pais
19      10267   FRANK           4          1   208.58  Alemania
38      10286   QUICK           8          3   229.24  Alemania
97      10345   QUICK           2          2   249.06  Alemania
267     10515   QUICK           2          1   204.47  Alemania
292     10540   QUICK           3          3  1007.64  Alemania
410     10658   QUICK           4          1   364.15  Alemania
422     10670   FRANK           4          1   203.48  Alemania
443     10691   QUICK           2          2   810.05  Alemania
446     10694   QUICK           8          3   398.36  Alemania
569     10817   KOENE           3          2   306.07  Alemania
597     10845   QUICK           8          1   212.98  Alemania
617     10865   QUICK           2          1   348.14  Alemania
714     10962   QUICK           8          2   275.79  Alemania
764     11012   FRANK           1          3   242.95  Alemania
773     11021   QUICK           3          1   297.18  Alemania

In [16]:
dfAle.to_excel("../ficheros/alemania.xlsx", index=False)

In [17]:
df.head()

   idpedido cliente  idempleado  idempresa  importe       pais
0     10248   WILMK           5          3    32.38  Finlandia
1     10249   TOMSP           6          1    11.61   Alemania
2     10250   HANAR           4          2    65.83     Brasil
3     10251   VICTE           3          1    41.34    Francia
4     10252   SUPRD           4          2    51.30    Belgica

In [18]:
df['porc_iva'] = 0.21
df['iva'] = round(df.porc_iva * df.importe, 2)
df['total'] = round(df.iva + df.importe, 2)
df.head()

,idpedido,cliente,idempleado,idempresa,importe,pais,porc_iva,iva,total
0,10248,WILMK,5,3,32.38,Finlandia,0.21,6.80,39.18
1,10249,TOMSP,6,1,11.61,Alemania,0.21,2.44,14.05
2,10250,HANAR,4,2,65.83,Brasil,0.21,13.82,79.65
3,10251,VICTE,3,1,41.34,Francia,0.21,8.68,50.02
4,10252,SUPRD,4,2,51.30,Belgica,0.21,10.77,62.07

In [19]:
df2 = df[['idpedido','cliente','importe','porc_iva','iva','total','pais']]
df2.head()

   idpedido cliente  importe  porc_iva    iva  total       pais
0     10248   WILMK    32.38      0.21   6.80  39.18  Finlandia
1     10249   TOMSP    11.61      0.21   2.44  14.05   Alemania
2     10250   HANAR    65.83      0.21  13.82  79.65     Brasil
3     10251   VICTE    41.34      0.21   8.68  50.02    Francia
4     10252   SUPRD    51.30      0.21  10.77  62.07    Belgica

In [21]:
df2.to_csv('../ficheros/totales.csv', index=False, sep=';', decimal=',')